---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateBeamOrBrace
source: html/6126acf8-bea3-a06f-17c3-1c703a6c92e3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateBeamOrBrace Property

Beam or Brace is slightly off axis and may cause inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccurateBeamOrBrace { get; }
```